def area(a, b): 
	'''
	Возвращает площадь прямоугольника со смежными сторонами a и b (длина и ширина).

		Параметры:

    			a (float) – длина прямоугольника

    			b (float) – вторая прямоугольника

		Возвращаемое значение:

			S (float) – периметр прямоугольника с длиной a и шириной b
	'''
    return a * b 

def perimeter(a, b): 
	'''
	Возвращает периметр прямоугольника со смежными сторонами a и b.

		Параметры:

    			a (float) – длина прямоугольника

    			b (float) – вторая прямоугольника

		Возвращаемое значение:

			P (float) – периметр прямоугольника с длиной a и шириной b
	'''
    return 2*(a + b)
